In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [7]:
df_2013 = pd.read_excel("C:/Users/simhaj-local/Documents/GitHub/NordPool/Daily/elspot-volumes-ipynb/elspot-volumes-xlsx/01. elspot-volumes_2013_daily.xlsx")

#df.read_2014 = pd.read_excel("02. elspot-volumes_2014_daily.xlsx")

#df.read_2015 = pd.read_excel("03. elspot-volumes_2015_daily.xlsx")

#df.read_2016 = pd.read_excel("04. elspot-volumes_2016_daily.xlsx")

#df.read_2017 = pd.read_excel("05. elspot-volumes_2017_daily.xlsx")

#df.read_2018 = pd.read_excel("06. elspot-volumes_2018_daily.xlsx")

#df.read_2019 = pd.read_excel("07. elspot-volumes_2019_daily.xlsx")

df_2013.head()

,Date_daily,Turnover at system price,NO1 Buy,NO1 Sell,NO2 Buy,NO2 Sell,NO3 Buy,NO3 Sell,NO4 Buy,NO4 Sell,...,DK2 Buy,DK2 Sell,EE Buy,EE Sell,ELE Buy,ELE Sell,LV Buy,LV Sell,LT Buy,LT Sell
0,2013-01-01 00:00:00,"884507,5","105883,6","63996,3","84607,1","98341,5","55126,4","24191,1","47093,0","38283,3",...,"32808,8","39501,0","22675,2","21558,8","7948,6","1781,5",NaN,NaN,"17271,2","17271,2"
1,2013-02-01 00:00:00,"1079788,1","130634,7","94070,9","108257,2","157631,7","62018,9","34180,9","49990,8","64995,5",...,"46788,9","33956,1","27153,5","29790,8","10689,2","2092,0",NaN,NaN,"19325,5","19325,5"
2,2013-03-01 00:00:00,"1042113,8","127549,2","80110,3","106319,5","139616,1","59612,8","31073,5","49374,7","57189,5",...,"45813,2","37439,3","27338,9","29654,2","12430,4","2051,8",NaN,NaN,"22124,5","22124,5"
3,2013-04-01 00:00:00,"1046514,5","126516,0","82168,7","105673,0","150121,3","57818,1","33621,8","49999,1","61061,5",...,"45484,9","31551,2","28261,0","27510,3","9524,8","2398,9",NaN,NaN,"23829,7","23829,7"
4,2013-05-01 00:00:00,"1010525,3","117503,5","77679,0","99966,0","136712,1","55664,7","35985,6","47581,9","62754,2",...,"42074,9","26108,8","26930,3","26300,0","8776,8","3230,0",NaN,NaN,"19972,6","19972,6"